; domain
(
    define (domain Orbital_domain_Q1)

    (:requirements :strips :typing :negative-preconditions :quantified-preconditions :equality :disjunctive-preconditions :conditional-effects)

    (:types
        location size - object
        item - object
        component - item
        valve tank sensor - component
        tool - item
        fault symptom diagnostic_test recovery_action - object
    )

    (:predicates
        ;; ---------------- spatial / structural ----------------
        (robot-at ?l - location)
        (component_at ?c - component ?l - location)
        (tank_at ?t - tank ?l - location)
        (is_connected ?l1 - location ?l2 - location)
        (valve_connect ?v - valve ?t1 - tank ?t2 - tank)
        (monitor ?s - sensor ?t - tank)
        (is_open ?v - valve)
        (has_size ?obj - object ?sz - size)
        (warehause_location ?l - location)

        ;; ---------------- manipulation ----------------
        (hand_empty)
        (has_item ?i - item)
        (item_at ?i - item ?l - location)
        (in_toolbox ?i - item)
        (is_adjustable ?tool - tool)
        (can_torque ?tool - tool)
        (is_spare ?c - component)

        ;; ---------------- diagnostic knowledge base ----------------
        (applicable_test ?t - diagnostic_test ?c - component)
        (test_requires_symptom ?t - diagnostic_test ?sy - symptom)
        (test_requires_open ?t - diagnostic_test)
        (test_requires_closed ?t - diagnostic_test)
        (test_requires_neighbor ?t - diagnostic_test)
        (unreliable_symptom ?sy - symptom)
        (test_indicates ?t - diagnostic_test ?f - fault)
        (fault_prevents_movement ?f - fault)
        (fixed_by ?r - recovery_action ?f - fault)
        (recovery_requires_closed ?r - recovery_action)
        (recovery_requires_torque ?r - recovery_action)
        (recovery_requires_spare ?r - recovery_action)
        (recovery_clears_symptom ?r - recovery_action ?sy - symptom)
        (recovery_sets_symptom ?r - recovery_action ?sy - symptom)

        ;; ---------------- dynamic diagnostic state ----------------
        (shows ?c - component ?sy - symptom)
        (test_done ?t - diagnostic_test ?c - component)
        (possible_fault ?c - component ?f - fault)
        (confirmed_fault ?c - component ?f - fault)
        (recovery_done ?r - recovery_action ?c - component)
        (component_ok ?c - component)

        (everything_ok)
    )


    ; --------------------------- Diagnostic reasoning -------------------------
    ;-----------start-----------
    (:action run_diagnostic_valve_stuck
        :parameters (?v - valve ?t1 ?t2 - tank ?s1 ?s2 - sensor ?test - diagnostic_test ?f - fault ?sy - symptom)
        :precondition (and 
            (applicable_test ?test ?v)
            (not (test_done ?test ?v))
            (test_indicates ?test ?f) 
            (test_requires_symptom ?test ?sy) 
            
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s1 ?t1)
            (monitor ?s2 ?t2)
            (or (not (test_requires_open ?test)) (is_open ?v))
            (or (not (test_requires_closed ?test)) (not (is_open ?v)))

            (shows ?s1 ?sy)
            (shows ?s2 ?sy)
        )
        :effect (and 
            (possible_fault ?v ?f)
            (test_done ?test ?v)
        )
    )

    (:action run_diagnostic_valve_single_sensor
        :parameters (?v - valve ?t1 ?t2 - tank ?s ?s_other - sensor ?test - diagnostic_test ?f - fault ?sy ?sy_other - symptom)
        :precondition (and
            (applicable_test ?test ?v)
            (not (test_done ?test ?v))
            (test_indicates ?test ?f)
            (test_requires_symptom ?test ?sy)

            (valve_connect ?v ?t1 ?t2)
            (monitor ?s ?t1)
            (monitor ?s_other ?t2)
            (or (not (test_requires_open ?test)) (is_open ?v))
            (or (not (test_requires_closed ?test)) (not (is_open ?v)))

            (shows ?s ?sy)
            (shows ?s_other ?sy_other)
            (unreliable_symptom ?sy_other)
        )
        :effect (and
            (possible_fault ?v ?f)
            (test_done ?test ?v)
        )
    )

    (:action run_diagnostic_sensor_discrepancy
        :parameters (?s_faulty ?s_ok - sensor ?v - valve ?t1 ?t2 - tank ?test - diagnostic_test ?f - fault ?sy_faulty ?sy_ok - symptom)
        :precondition (and 
            (applicable_test ?test ?s_faulty)
            (not (test_done ?test ?s_faulty))
            (test_indicates ?test ?f)
            (test_requires_symptom ?test ?sy_faulty)
            (test_requires_neighbor ?test)

            (is_open ?v) 
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s_faulty ?t1)
            (monitor ?s_ok ?t2)

            (shows ?s_faulty ?sy_faulty)
            (shows ?s_ok ?sy_ok)
            (not (= ?sy_faulty ?sy_ok))
        )
        :effect (and 
            (possible_fault ?s_faulty ?f)
            (test_done ?test ?s_faulty)
        )
    )

    (:action run_diagnostic_sensor_self
        :parameters (?s - sensor ?test - diagnostic_test ?f - fault ?sy - symptom)
        :precondition (and
            (applicable_test ?test ?s)
            (not (test_done ?test ?s))
            (test_indicates ?test ?f)
            (test_requires_symptom ?test ?sy)
            (not (test_requires_neighbor ?test))

            (shows ?s ?sy)
        )
        :effect (and
            (possible_fault ?s ?f)
            (test_done ?test ?s)
        )
    )


    ;--------------clear-------------
    (:action run_diagnostic_valve_clear
        :parameters (?v - valve ?t1 ?t2 - tank ?s1 ?s2 - sensor ?test - diagnostic_test ?sy_fault - symptom)
        :precondition (and 
            (applicable_test ?test ?v)
            (not (test_done ?test ?v))
            (test_requires_symptom ?test ?sy_fault)
            
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s1 ?t1)
            (monitor ?s2 ?t2)

            (or (not (test_requires_open ?test)) (is_open ?v))
            (or (not (test_requires_closed ?test)) (not (is_open ?v)))

            (not (shows ?s1 ?sy_fault))
            (not (shows ?s2 ?sy_fault))
        )
        :effect (and 
            (test_done ?test ?v)
        )
    )

    (:action run_diagnostic_sensor_clear
        :parameters (?s_target ?s_other - sensor ?v - valve ?t1 ?t2 - tank ?test - diagnostic_test ?sy_fault - symptom)
        :precondition (and 
            (applicable_test ?test ?s_target)
            (not (test_done ?test ?s_target))
            (test_requires_symptom ?test ?sy_fault)
            (test_requires_neighbor ?test)
            
            ;(is_open ?v)
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s_target ?t1)
            (monitor ?s_other ?t2)

            (or (not (shows ?s_target ?sy_fault)) (shows ?s_other ?sy_fault))
        )
        :effect (and 
            (test_done ?test ?s_target)
        )
    )

    (:action run_diagnostic_sensor_self_clear
        :parameters (?s - sensor ?v - valve ?t1 ?t2 - tank ?test - diagnostic_test ?sy - symptom)
        :precondition (and
            (applicable_test ?test ?s)
            (not (test_done ?test ?s))
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s ?t1)
            (test_requires_symptom ?test ?sy)
            (not (test_requires_neighbor ?test))

            (not (shows ?s ?sy))
        )
        :effect (and
            (test_done ?test ?s)
        )
    )


    ;------------------confirm or rule out faults----------------
    (:action confirm_fault
        :parameters (?c - component ?f - fault)
        :precondition (and
            (possible_fault ?c ?f)
            (not (confirmed_fault ?c ?f))
            (forall (?t - diagnostic_test)
                (or (not (applicable_test ?t ?c)) (test_done ?t ?c)))
            (not (exists (?f2 - fault) 
                (and (possible_fault ?c ?f2) 
                     (not (= ?f2 ?f)))))
        )
        :effect (and
            (confirmed_fault ?c ?f)
        )
    )

    (:action rule_out_fault
        :parameters (?c - component)
        :precondition (and
            (not (component_ok ?c))
            (not (exists (?f - fault) (or (possible_fault ?c ?f) (confirmed_fault ?c ?f))))
            (forall (?t - diagnostic_test)
                (or (not (applicable_test ?t ?c)) (test_done ?t ?c)))
        )
        :effect (and
            (component_ok ?c)
        )
    )


    ; ------------------ Recovery actions ------------------

    (:action apply_mechanical_recovery
        :parameters (?r - recovery_action ?f - fault ?v - valve ?l - location ?tool - tool ?size_needed - size ?s1 ?s2 - sensor ?t1 ?t2 - tank ?sy_old ?sy_new - symptom)
        :precondition (and
            (confirmed_fault ?v ?f)
            (fixed_by ?r ?f)
            (recovery_requires_torque ?r)
            (component_at ?v ?l)
            (robot-at ?l)
            (has_item ?tool)
            (can_torque ?tool)
            (has_size ?tool ?size_needed)
            (has_size ?v ?size_needed)
            (or (not (recovery_requires_closed ?r)) (not (is_open ?v)))
            (valve_connect ?v ?t1 ?t2)
            (monitor ?s1 ?t1)
            (monitor ?s2 ?t2)
            (recovery_clears_symptom ?r ?sy_old)
            (recovery_sets_symptom ?r ?sy_new)
        )
        :effect (and
            (not (confirmed_fault ?v ?f))
            (not (possible_fault ?v ?f))
            (recovery_done ?r ?v)
            (not (shows ?s1 ?sy_old))
            (shows ?s1 ?sy_new)
            (not (shows ?s2 ?sy_old))
            (shows ?s2 ?sy_new)
            (forall (?t - diagnostic_test) (and (not (test_done ?t ?v))))
        )
    )

    (:action apply_replacement_recovery
        :parameters (?r - recovery_action ?f - fault ?s_old ?s_new - sensor ?t - tank ?l - location ?sy_old ?sy_new - symptom)
        :precondition (and
            (confirmed_fault ?s_old ?f)
            (fixed_by ?r ?f)
            (recovery_requires_spare ?r)
            (robot-at ?l)
            (tank_at ?t ?l)
            (monitor ?s_old ?t)
            (has_item ?s_new)
            (is_spare ?s_new)
            (forall (?v - valve ?t_other - tank)
                (or (not (valve_connect ?v ?t ?t_other))
                    (not (is_open ?v))))
            (shows ?s_old ?sy_old)
            (recovery_clears_symptom ?r ?sy_old)
            (recovery_sets_symptom ?r ?sy_new)
        )
        :effect (and
            (not (confirmed_fault ?s_old ?f))
            (not (possible_fault ?s_old ?f))
            (not (monitor ?s_old ?t))
            (monitor ?s_new ?t)
            (not (has_item ?s_new))
            (has_item ?s_old)
            (recovery_done ?r ?s_new)
            (forall (?t2 - diagnostic_test)
                (and (not (test_done ?t2 ?s_old))))
            (not (shows ?s_old ?sy_old))
            (shows ?s_new ?sy_new)
        )
    )

    
    (:action verify_repair
        :parameters (?c - component ?r - recovery_action ?f - fault)
        :precondition (and
            (recovery_done ?r ?c)
            (fixed_by ?r ?f)
            (not (exists (?f2 - fault) (or (possible_fault ?c ?f2) (confirmed_fault ?c ?f2))))
            (forall (?t - diagnostic_test)
                (or (not (applicable_test ?t ?c)) (test_done ?t ?c)))
        )
        :effect (and
            (component_ok ?c)
            (not (recovery_done ?r ?c))
        )
    )


    ; ------------------ Robot actions ------------------
    (:action move
        :parameters (?l1 ?l2 - location)
        :precondition (and
            (robot-at ?l1)
            (is_connected ?l1 ?l2)
        )
        :effect (and
            (not (robot-at ?l1))
            (robot-at ?l2)
        )
    )

    (:action close_valve
        :parameters (?v - valve ?l - location ?t1 ?t2 - tank)
        :precondition (and
            (robot-at ?l)
            (component_at ?v ?l)
            (is_open ?v)
            (hand_empty)
            (not (exists (?f - fault) (and (confirmed_fault ?v ?f) (fault_prevents_movement ?f))))
            (valve_connect ?v ?t1 ?t2)
            
        )
        :effect (and
            (not (is_open ?v))
        )
    )

    (:action open_valve
        :parameters (?v - valve ?l - location ?t1 ?t2 - tank)
        :precondition (and
            (robot-at ?l)
            (component_at ?v ?l)
            (valve_connect ?v ?t1 ?t2)
            (not (is_open ?v))
            (hand_empty)
            (not (exists (?f - fault) 
                (and 
                    (or (confirmed_fault ?v ?f) (possible_fault ?v ?f)) 
                    (fault_prevents_movement ?f)
                )
            ))
            (forall (?test - diagnostic_test)
                (or 
                    (not (applicable_test ?test ?v))
                    (not (test_requires_closed ?test))
                    (test_done ?test ?v)
                )
            )
        )
        :effect (and
            (is_open ?v)
        )
    )


    ;; -------- Manipulate object actions --------
    (:action pick_up_item
        :parameters (?item - item ?l - location)
        :precondition (and
            (robot-at ?l)
            (item_at ?item ?l)
            (hand_empty)
        )
        :effect (and
            (not (hand_empty))
            (has_item ?item)
            (not (item_at ?item ?l))
        )
    )

    (:action release_item
        :parameters (?item - item ?l - location)
        :precondition (and
            (has_item ?item)
            (robot-at ?l)
            (warehause_location ?l)
        )
        :effect (and
            (not (has_item ?item))
            (item_at ?item ?l)
            (hand_empty)
        )
    )

    (:action adjust_tool
        :parameters (?tool - tool ?comp - object ?tool_size - size ?comp_size - size)
        :precondition (and
            (is_adjustable ?tool)
            (has_item ?tool)
            (has_size ?tool ?tool_size)
            (has_size ?comp ?comp_size)
            (not (= ?tool_size ?comp_size))
        )
        :effect (and
            (not (has_size ?tool ?tool_size))
            (has_size ?tool ?comp_size)
        )
    )

    (:action equip_from_toolbox
        :parameters (?i - item)
        :precondition (and
            (in_toolbox ?i)
            (hand_empty)
        )
        :effect (and
            (not (in_toolbox ?i))
            (has_item ?i)
            (not (hand_empty))
        )
    )

    (:action stow_in_toolbox
        :parameters (?i - item)
        :precondition (and
            (has_item ?i)
        )
        :effect (and
            (not (has_item ?i))
            (in_toolbox ?i)
            (hand_empty)
        )
    )


    ;--------- Everything is ok ----------
    (:action checking_everything
        :parameters ()
        :precondition (and
            (forall (?v - valve) (component_ok ?v))
            (forall (?s - sensor)
                (or (not (exists (?t - tank) (monitor ?s ?t))) (component_ok ?s)))
        )
        :effect (and
            (everything_ok))
    )

)

; problem
(define (problem Problem_Q1_1) (:domain Orbital_domain_Q1)

(:objects
    loc1 loc2 loc3 - location
    valve1 - valve
    tank1 tank2 - tank
    sensor1 sensor2 spare_sensor1 - sensor
    adjustable_wrench - tool
    small medium large - size

    ;; --- diagnostic knowledge base objects ---
    valve_stuck_fault valve_leak_fault sensor_crazy_fault sensor_dead_fault - fault
    pressure_changing pressure_stable erratic_reading - symptom
    open_valve_test closed_valve_test sensor_self_test sensor_comparison_test - diagnostic_test
    unstuck_fix tighten_fix replace_fix - recovery_action
)

(:init
    (robot-at loc1)
    (component_at valve1 loc2)
    (tank_at tank1 loc1) (tank_at tank2 loc3)
    (warehause_location loc3)
    (item_at spare_sensor1 loc3)
    (is_spare spare_sensor1)
    (has_size valve1 small)

    (is_connected loc1 loc2) (is_connected loc2 loc1)
    (is_connected loc2 loc3) (is_connected loc3 loc2)

    (valve_connect valve1 tank1 tank2) (valve_connect valve1 tank2 tank1)

    (monitor sensor1 tank1) (monitor sensor2 tank2)

    (is_open valve1)
    

    (can_torque adjustable_wrench)
    (has_size adjustable_wrench medium)
    (is_adjustable adjustable_wrench)
    (in_toolbox adjustable_wrench)
    (hand_empty)

    ;; ---------------- diagnostic knowledge base ----------------
    (applicable_test open_valve_test valve1)
    (applicable_test sensor_self_test sensor1)
    (applicable_test sensor_self_test sensor2)
    (applicable_test sensor_self_test spare_sensor1)
    (applicable_test sensor_comparison_test sensor1)
    (applicable_test sensor_comparison_test sensor2)
    (applicable_test sensor_comparison_test spare_sensor1)

    (test_requires_symptom open_valve_test pressure_stable)
    (test_requires_symptom closed_valve_test pressure_changing)
    (test_requires_symptom sensor_self_test erratic_reading)
    (test_requires_symptom sensor_comparison_test pressure_stable)
    
    (test_requires_open open_valve_test)
    (test_requires_closed closed_valve_test)
    (test_requires_neighbor sensor_comparison_test)
    (unreliable_symptom erratic_reading)

    (test_indicates open_valve_test valve_stuck_fault)
    (test_indicates closed_valve_test valve_leak_fault)
    (test_indicates sensor_self_test sensor_crazy_fault)
    (test_indicates sensor_comparison_test sensor_dead_fault)

    (fault_prevents_movement valve_stuck_fault)
    (fault_prevents_movement valve_leak_fault)

    (fixed_by unstuck_fix valve_stuck_fault)
    (fixed_by tighten_fix valve_leak_fault)
    (fixed_by replace_fix sensor_crazy_fault)
    (fixed_by replace_fix sensor_dead_fault)

    (recovery_requires_torque unstuck_fix)
    (recovery_requires_torque tighten_fix)
    (recovery_requires_closed tighten_fix)
    (recovery_requires_spare replace_fix)

    (recovery_clears_symptom unstuck_fix pressure_stable)
    (recovery_sets_symptom unstuck_fix pressure_changing)
    (recovery_clears_symptom tighten_fix pressure_changing)
    (recovery_sets_symptom tighten_fix pressure_stable)
    (recovery_clears_symptom replace_fix erratic_reading)
    (recovery_clears_symptom replace_fix pressure_stable)
    (recovery_sets_symptom replace_fix pressure_changing)

    ;; ---------------- observed symptoms ----------------
    (shows sensor1 pressure_stable)
    (shows sensor2 pressure_changing)

)

(:goal (and
    (everything_ok)
    (hand_empty)
    (forall (?i - item) (or (not (in_toolbox ?i))
                            (= ?i adjustable_wrench)
    ))
))

)

; plan
1. (move loc1 loc2)
   deleted: (robot-at loc1)
   added: (robot-at loc2)
   goals met: 2 of 3
2. (move loc2 loc3)
   deleted: (robot-at loc2)
   added: (robot-at loc3)
   goals met: 2 of 3
3. (pick_up_item spare_sensor1 loc3)
   deleted: (hand_empty) (item_at spare_sensor1 loc3)
   added: (has_item spare_sensor1)
   goals met: 1 of 3
4. (stow_in_toolbox spare_sensor1)
   deleted: (has_item spare_sensor1)
   added: (in_toolbox spare_sensor1) (hand_empty)
   goals met: 1 of 3
5. (run_diagnostic_sensor_clear sensor2 sensor1 valve1 tank2 tank1 sensor_comparison_test pressure_stable)
   added: (test_done sensor_comparison_test sensor2)
   goals met: 1 of 3
6. (run_diagnostic_sensor_discrepancy sensor1 sensor2 valve1 tank1 tank2 sensor_comparison_test sensor_dead_fault pressure_stable pressure_changing)
   added: (possible_fault sensor1 sensor_dead_fault) (test_done sensor_comparison_test sensor1)
   goals met: 1 of 3
7. (move loc3 loc2)
   deleted: (robot-at loc3)
   added: (robot-at loc2)
   goals met: 1 of 3
8. (close_valve valve1 loc2 tank1 tank2)
   deleted: (is_open valve1)
   goals met: 1 of 3
9. (run_diagnostic_sensor_self_clear sensor2 valve1 tank2 tank1 sensor_self_test erratic_reading)
   added: (test_done sensor_self_test sensor2)
   goals met: 1 of 3
10. (rule_out_fault sensor2)
   added: (component_ok sensor2)
   goals met: 1 of 3
11. (move loc2 loc1)
   deleted: (robot-at loc2)
   added: (robot-at loc1)
   goals met: 1 of 3
12. (run_diagnostic_sensor_self_clear sensor1 valve1 tank1 tank2 sensor_self_test erratic_reading)
   added: (test_done sensor_self_test sensor1)
   goals met: 1 of 3
13. (confirm_fault sensor1 sensor_dead_fault)
   added: (confirmed_fault sensor1 sensor_dead_fault)
   goals met: 1 of 3
14. (equip_from_toolbox spare_sensor1)
   deleted: (in_toolbox spare_sensor1) (hand_empty)
   added: (has_item spare_sensor1)
   goals met: 1 of 3
15. (apply_replacement_recovery replace_fix sensor_dead_fault sensor1 spare_sensor1 tank1 loc1 pressure_stable pressure_changing)
   deleted: (confirmed_fault sensor1 sensor_dead_fault) (possible_fault sensor1 sensor_dead_fault) (monitor sensor1 tank1) (has_item spare_sensor1) (test_done sensor_self_test sensor1) (test_done sensor_comparison_test sensor1) (shows sensor1 pressure_stable)
   added: (monitor spare_sensor1 tank1) (has_item sensor1) (recovery_done replace_fix spare_sensor1) (shows spare_sensor1 pressure_changing)
   goals met: 1 of 3
16. (stow_in_toolbox sensor1)
   deleted: (has_item sensor1)
   added: (in_toolbox sensor1) (hand_empty)
   goals met: 1 of 3
17. (run_diagnostic_sensor_clear spare_sensor1 sensor2 valve1 tank1 tank2 sensor_comparison_test pressure_stable)
   added: (test_done sensor_comparison_test spare_sensor1)
   goals met: 1 of 3
18. (run_diagnostic_sensor_self_clear spare_sensor1 valve1 tank1 tank2 sensor_self_test erratic_reading)
   added: (test_done sensor_self_test spare_sensor1)
   goals met: 1 of 3
19. (verify_repair spare_sensor1 replace_fix sensor_dead_fault)
   deleted: (recovery_done replace_fix spare_sensor1)
   added: (component_ok spare_sensor1)
   goals met: 1 of 3
20. (move loc1 loc2)
   deleted: (robot-at loc1)
   added: (robot-at loc2)
   goals met: 1 of 3
21. (open_valve valve1 loc2 tank1 tank2)
   added: (is_open valve1)
   goals met: 1 of 3
22. (run_diagnostic_valve_clear valve1 tank2 tank1 sensor2 spare_sensor1 open_valve_test pressure_stable)
   added: (test_done open_valve_test valve1)
   goals met: 1 of 3
23. (rule_out_fault valve1)
   added: (component_ok valve1)
   goals met: 1 of 3
24. (checking_everything)
   added: (everything_ok)
   goals met: 2 of 3
25. (equip_from_toolbox sensor1)
   deleted: (in_toolbox sensor1) (hand_empty)
   added: (has_item sensor1)
   goals met: 2 of 3
26. (move loc2 loc3)
   deleted: (robot-at loc2)
   added: (robot-at loc3)
   goals met: 2 of 3
27. (release_item sensor1 loc3)
   deleted: (has_item sensor1)
   added: (item_at sensor1 loc3) (hand_empty)
   goals met: 3 of 3
